app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`post_id` = 1
---
        <i class="fa-solid fa-heart fa-2xs" style="color: #F94646;"></i>
        <span><%= post.favorites.count %>いいね</span>

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`post_id` = 1
---
        <i class="fa-regular fa-heart fa-2xs" style="color: #F94646;"></i>
        <span><%= post.favorites.count %>いいね</span>