app/views/users/show.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`post_id` = 1
---
                        <% end %>
                        <%= post.favorites.count %>いいね