app/views/posts/show.html.erb

                    <i class="fa-regular fa-comment" style="color: #9D9D9D;"></i>
                    <p><%= @post.comments.count %>コメント</p>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1