app/controllers/favorites_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @favorite = current_user.favorites.create(post_id: params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `favorites` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (2, 1, '2023-11-29 03:47:49.389811', '2023-11-29 03:47:49.389811')

    def destroy
    # どのポストかを取ってきて@postに格納
        @post = Post.find(params[:post_id])
        @favorite = current_user.favorites.find_by(post_id: @post.id)
        @favorite.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 2 AND `favorites`.`post_id` = 1 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1