app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` LIMIT 5 OFFSET 0
---
  def index
    @posts = Post.page(params[:page])