app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_image_params)
    @post.user_id = current_user.id
    @post.save
---
INSERT INTO `posts` (`user_id`, `spot_type_id`, `caption`, `location`, `spot_detail`, `created_at`, `updated_at`, `other_info`) VALUES (1, 2, 'USJです', '大阪府大阪市此花区桜島２丁目１−３３', '色々なキャラクターがいます', '2023-11-29 03:42:19.176751', '2023-11-29 03:42:19.176751', '人がいっぱいです')

  def search
    search_word = params[:keyword]
    @posts = Post.where('location LIKE?', "%#{search_word}%")
---
SELECT `posts`.* FROM `posts` WHERE (location LIKE'%大阪府%')