app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `posts` WHERE `posts`.`user_id` = 1 LIMIT 5 OFFSET 0) subquery_for_count
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.page(params[:page]).order(created_at: :desc)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `users`.`introduction` = 'Twiceのminaです。', `users`.`updated_at` = '2023-11-29 03:47:12.802554' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)