app/models/user.rb

  def already_favorited?(post)
    self.favorites.exists?(post_id: post.id)
---
SELECT 1 AS one FROM `favorites` WHERE `favorites`.`user_id` = 2 AND `favorites`.`post_id` = 1 LIMIT 1

  def follow(user)
    self.relationships.create(followed_id: user.id)
---
INSERT INTO `follows` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (2, 1, '2023-11-29 03:48:27.445774', '2023-11-29 03:48:27.445774')